/*
 * Copyright © 2019 Soft-Tehnica
 *
 * This file is for seed nomenclator items
 * 
 */
[
  //4.1
  {
    "Name": "The organization shall determine external and internal issues that are relevant to its purpose and that affect its ability to achieve the intended outcome(s) of its information security management system.",
    "Id": "6777D956-F73C-41E6-AA42-53217C6606B1",
    "Author": "system",
    "Created": "2019-01-29T07:59:12.6160761Z",
    "ModifiedBy": null,
    "Changed": "2019-01-29T07:59:12.6160762Z",
    "IsDeleted": false,
    
    "CategoryId": "d733f0c9-e766-4261-94d4-ecb853a8587e"
  },
  //  4.2
  {
    "Name": "The organization shall determine:\n a) interested parties that are relevant to the information security management system; \n b) the requirements of these interested parties relevant to information security.",
    "Id": "3bf3a854-f61f-452f-b6e5-d88da1635f6c",
    "Author": "system",
    "Created": "2019-01-29T07:59:12.6160761Z",
    "ModifiedBy": null,
    "Changed": "2019-01-29T07:59:12.6160762Z",
    "IsDeleted": false,
    
    "CategoryId": "147F7D0B-6D90-480D-A253-577449F5C30D"
  },
  // 4.3
  {
    "Name": "The organization shall determine the boundaries and applicability of the information security management system to establish its scope. \n When determining this scope, the organization shall consider: \n a) the external and internal issues referred to in 4.1; \n b) the requirements referred to in 4.2; \n c) interfaces and dependencies between activities performed by the organization, and those that are performed by other organizations. \n The scope shall be available as documented information.",
    "Id": "b1f2be9d-d8fa-442b-9603-19b372aa7f77",
    "Author": "system",
    "Created": "2019-01-29T07:59:12.6160761Z",
    "ModifiedBy": null,
    "Changed": "2019-01-29T07:59:12.6160762Z",
    "IsDeleted": false,
    
    "CategoryId": "1c9b4345-c63b-4b84-95e9-0a421b4a6f3b"
  },
  //4.4
  {
    "Name": "The organization shall establish, implement, maintain and continually improve an information security management system, in accordance with the requirements of this International Standard.",
    "Id": "129ea1f4-d724-449e-aab3-df73d765edda",
    "Author": "system",
    "Created": "2019-01-29T07:59:12.6160761Z",
    "ModifiedBy": null,
    "Changed": "2019-01-29T07:59:12.6160762Z",
    "IsDeleted": false,
    
    "CategoryId": "21379a36-2e9c-4f9f-bc83-f638f85267d4"
  },
  //5.1
  {
    "Name": "Top management shall demonstrate leadership and commitment with respect to the information security management system by: \n a) ensuring the information security policy and the information security objectives are established and are compatible with the strategic direction of the organization; \n b) ensuring the integration of the information security management system requirements into the organization’s processes; \n c) ensuring that the resources needed for the information security management system are available; \n d) communicating the importance of effective information security management and of conforming to the information security management system requirements; \n e) ensuring that the information security management system achieves its intended outcome(s); \n f ) directing and supporting persons to contribute to the effectiveness of the information security management system; \n g) promoting continual improvement;\n h) supporting other relevant management roles to demonstrate their leadership as it applies to their areas of responsibility. ",
    "Id": "001f3ad4-7e7e-4f06-a13f-f76b71a417d5",
    "Author": "system",
    "Created": "2019-01-29T07:59:12.6160761Z",
    "ModifiedBy": null,
    "Changed": "2019-01-29T07:59:12.6160762Z",
    "IsDeleted": false,
    
    "CategoryId": "fddff19b-09eb-48db-af0f-4aa3afa33d1c"
  },
  //5.2
  {
    "Name": "Top management shall establish an information security policy that: \n a) is appropriate to the purpose of the organization; \n b) includes information security objectives (see 6.2) or provides the framework for setting information security objectives; \n c) includes a commitment to satisfy applicable requirements related to information security; \n d) includes a commitment to continual improvement of the information security management system. \n The information security policy shall: \n e) be available as documented information; \n f ) be communicated within the organization; \n g) be available to interested parties, as appropriate.",
    "Id": "883f8fad-9fc8-41ed-9ae5-31fb7558cd17",
    "Author": "system",
    "Created": "2019-01-29T07:59:12.6160761Z",
    "ModifiedBy": null,
    "Changed": "2019-01-29T07:59:12.6160762Z",
    "IsDeleted": false,
    
    "CategoryId": "9e376fc7-3492-4cd3-bac1-4be1df7b7ff8"
  },
  //5.3
  {
    "Name": "Top management shall ensure that the responsibilities and authorities for roles relevant to information security are assigned and communicated. \n Top management shall assign the responsibility and authority for: \n a) ensuring that the information security management system conforms to the requirements of this International Standard; \n b) reporting on the performance of the information security management system to top management.",
    "Id": "2e528777-3579-4759-a05b-1a4a7cf4b773",
    "Author": "system",
    "Created": "2019-01-29T07:59:12.6160761Z",
    "ModifiedBy": null,
    "Changed": "2019-01-29T07:59:12.6160762Z",
    "IsDeleted": false,
    
    "CategoryId": "f3e14405-4088-4180-8f04-3683207af912"
  },
  //6.1.1
  {
    "Name": "When planning for the information security management system, the organization shall consider the issues referred to in 4.1 and the requirements referred to in 4.2 and determine the risks and opportunities that need to be addressed to: \n a) ensure the information security management system can achieve its intended outcome(s); \n b) prevent, or reduce, undesired effects; \n c) achieve continual improvement. \n The organization shall plan: \n d) actions to address these risks and opportunities; \n e) how to \n  1) integrate and implement the actions into its information security management system processes; \n 2) evaluate the effectiveness of these actions. ",
    "Id": "30d88cd1-7af9-4f6a-8da4-5b294f500966",
    "Author": "system",
    "Created": "2019-01-29T07:59:12.6160761Z",
    "ModifiedBy": null,
    "Changed": "2019-01-29T07:59:12.6160762Z",
    "IsDeleted": false,
    
    "CategoryId": "774cf4fa-de30-44ac-9b96-722589f306cf"
  },
  //6.1.2
  {
    "Name": "The organization shall define and apply an information security risk assessment process that: \n a) establishes and maintains information security risk criteria that include: \n      1) the risk acceptance criteria; \n      2) criteria for performing information security risk assessments; \n b) ensures that repeated information security risk assessments produce consistent, valid and comparable results; \n c) identifies the information security risks: \n      1) apply the information security risk assessment process to identify risks associated with the loss of confidentiality, integrity and availability for information within the scope of the information security management system; \n      2) identify the risk owners; \n d) analyses the information security risks: \n      1) assess the potential consequences that would result if the risks identified in 6.1.2 c) 1) were to materialize; \n      2) assess the realistic likelihood of the occurrence of the risks identified in 6.1.2 c) 1); \n      3) determine the levels of risk; \n e) evaluates the information security risks: \n      1) compare the results of risk analysis with the risk criteria established in 6.1.2 a); \n      2) prioritize the analysed risks for risk treatment. \n The organization shall retain documented information about the information security risk assessment process.",
    "Id": "0e9bd356-8c72-4447-a876-d46317414261",
    "Author": "system",
    "Created": "2019-01-29T07:59:12.6160761Z",
    "ModifiedBy": null,
    "Changed": "2019-01-29T07:59:12.6160762Z",
    "IsDeleted": false,
    
    "CategoryId": "7836668d-d2ab-4877-86c4-2856b8484266"
  },
  //6.1.3
  {
    "Name": "The organization shall define and apply an information security risk treatment process to: \n a) select appropriate information security risk treatment options, taking account of the risk assessment results; \n b) determine all controls that are necessary to implement the information security risk treatment option(s) chosen; \n compare the controls determined in 6.1.3 b) above with those in Annex A and verify that no necessary controls have been omitted; \n NOTE 1 AnnexA contains a comprehensive list of control objectives and controls. Users of this International Standard are directed to Annex A to ensure that no necessary controls are overlooked. \n NOTE 2 Control objectives are implicitly included in the controls chosen. The control objectives and controls listed in Annex A are not exhaustive and additional control objectives and controls may be needed. \n d) produce a Statement of Applicability that contains the necessary controls (see 6.1.3 b) and c)) and justification for inclusions, whether they are implemented or not, and the justification for exclusions of controls from Annex A; \n e) formulate an information security risk treatment plan; \n  f) obtain risk owners’ approval of the information security risk treatment plan and acceptance of the residual information security risks. \n The organization shall retain documented information about the information security risk treatment process.  \n NOTE The information security risk assessment and treatment process in this International Standard aligns with the principles and generic guidelines provided in ISO 31000[5]. ",
    "Id": "868a992f-92bd-46bf-9237-b5e5291cc926",
    "Author": "system",
    "Created": "2019-01-29T07:59:12.6160761Z",
    "ModifiedBy": null,
    "Changed": "2019-01-29T07:59:12.6160762Z",
    "IsDeleted": false,
    
    "CategoryId": "c90c155f-c51b-46f4-962f-76f86eb2cee7"
  },
  //6.2
  {
    "Name": "The organization shall establish information security objectives at relevant functions and levels. \n The information security objectives shall: \n a) be consistent with the information security policy; \n b) be measurable (if practicable); \n c) take into account applicable information security requirements, and results from risk assessment and risk treatment; \n d) be communicated; \n be updated as appropriate. \n The organization shall retain documented information on the information security objectives. \n When planning how to achieve its information security objectives, the organization shall determine: \n f) what will be done; \n g) what resources will be required; \n h) who will be responsible; \n i) when it will be completed; \n j) how the results will be evaluated.  ",
    "Id": "3034552b-89b4-484b-bc50-49fb944497ac",
    "Author": "system",
    "Created": "2019-01-29T07:59:12.6160761Z",
    "ModifiedBy": null,
    "Changed": "2019-01-29T07:59:12.6160762Z",
    "IsDeleted": false,
    
    "CategoryId": "a475a041-19e9-4922-8433-0d98b2cd4cbb"
  },
  //7.1
  {
    "Name": "The organization shall determine and provide the resources needed for the establishment, implementation,maintenance and continual improvement of the information security management system.",
    "Id": "bb324de2-9ee7-4fde-b479-82d288ad9f4b",
    "Author": "system",
    "Created": "2019-01-29T07:59:12.6160761Z",
    "ModifiedBy": null,
    "Changed": "2019-01-29T07:59:12.6160762Z",
    "IsDeleted": false,
    
    "CategoryId": "bd06421c-a45c-4a50-925d-b9c17fe48083"
  },
  //7.2
  {
    "Name": "The organization shall: \n a) determine the necessary competence of person(s) doing work under its control that affects its information security performance; \n b) ensure that these persons are competent on the basis of appropriate education, training, or experience; \n c) where applicable, take actions to acquire the necessary competence, and evaluate the effectiveness of the actions taken; \n d) retain appropriate documented information as evidence of competence. \n NOTE Applicable actions may include, for example: the provision of training to, the mentoring of, or the re-assignment of current employees; or the hiring or contracting of competent persons.",
    "Id": "04235504-a2e9-413e-a8c6-8fe373d9db2f",
    "Author": "system",
    "Created": "2019-01-29T07:59:12.6160761Z",
    "ModifiedBy": null,
    "Changed": "2019-01-29T07:59:12.6160762Z",
    "IsDeleted": false,
    
    "CategoryId": "d07f909e-7ccd-4084-b692-7a12cf7c7da0"
  },
  //7.3
  {
    "Name": "Persons doing work under the organization’s control shall be aware of: \n a) the information security policy; \n b) their contribution to the effectiveness of the information security management system, including the benefits of improved information security performance; \n c) the implications of not conforming with the information security management system requirements.",
    "Id": "a545d5d7-1fc9-4416-b16f-04bb9233df66",
    "Author": "system",
    "Created": "2019-01-29T07:59:12.6160761Z",
    "ModifiedBy": null,
    "Changed": "2019-01-29T07:59:12.6160762Z",
    "IsDeleted": false,
    
    "CategoryId": "04cb3656-a48b-4a84-bf94-7245158bd2d8"
  },
  //7.4
  {
    "Name": "The organization shall determine the need for internal and external communications relevant to the information security management system including: \n a) on what to communicate; \n b) when to communicate; \n c) with whom to communicate; \n d) who shall communicate; \n e) the processes by which communication shall be effected. ",
    "Id": "0c2f8b11-408a-4bfe-8e7a-0ef1ce613b6b",
    "Author": "system",
    "Created": "2019-01-29T07:59:12.6160761Z",
    "ModifiedBy": null,
    "Changed": "2019-01-29T07:59:12.6160762Z",
    "IsDeleted": false,
    
    "CategoryId": "ab051cb3-1f0c-48aa-8816-a2db159c7576"
  },
  //7.5.1
  {
    "Name": "The organization’s information security management system shall include: \n a) documented information required by this International Standard; \n b) documented information determined by the organization as being necessary for the effectiveness of the information security management system. \n NOTE The extent of documented information for an information security management system can differ from one organization to another due to: \n 1) the size of organization and its type of activities, processes, products and services; \n 2) the complexity of processes and their interactions; \n 3) the competence of persons.   ",
    "Id": "e32841b4-5cec-4830-ab6a-9ef1e918f388",
    "Author": "system",
    "Created": "2019-01-29T07:59:12.6160761Z",
    "ModifiedBy": null,
    "Changed": "2019-01-29T07:59:12.6160762Z",
    "IsDeleted": false,
    
    "CategoryId": "f2d87774-2f80-40d7-9faf-7f614a4330d9"
  },
  //7.5.2
  {
    "Name": "When creating and updating documented information the organization shall ensure appropriate: \n a) identification and description (e.g. a title, date, author, or reference number); \n b) format (e.g. language, software version, graphics) and media (e.g. paper, electronic); \n c) review and approval for suitability and adequacy. ",
    "Id": "5a704e92-66e5-4963-a7ef-79fef679e5ed",
    "Author": "system",
    "Created": "2019-01-29T07:59:12.6160761Z",
    "ModifiedBy": null,
    "Changed": "2019-01-29T07:59:12.6160762Z",
    "IsDeleted": false,
    
    "CategoryId": "0d91d5e1-2ffc-4d57-9146-c51369ca193e"
  }



]


